app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users= User.all.sort_by{|user|user.last_name.to_s.downcase}

INSERT INTO "users" ("last_name", "first_name", "birthday", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["last_name", "xabi"], ["first_name", "xab"], ["birthday", "1991-10-08 00:00:00"], ["created_at", "2021-10-12 07:45:07.771642"], ["updated_at", "2021-10-12 07:45:07.771642"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save